# Голосарій 1.0

programing_terms = {
    "Абстракція": "− в об’єктно-орієнтованому програмуванні це надання об'єкту характеристик, які відрізняють його від всіх інших об'єктів, чітко визначаючи його концептуальні границі.",
    "Активний файл": "− те саме, що відкритий файл.",
    "Адреса": "– номер байта в оперативній або іншій пам'яті комп'ютера.",
    "Біт": '− найменша одиниця інформації в комп\'ютері, що приймає значення "0" або "1".',
    "Блок-схема": "– форма вираження алгоритмів. Послідовність дій задається стрілками.",
}


print(f'Абстракція: \n {programing_terms["Абстракція"]}\n')
print(f'Активний файл: \n {programing_terms["Активний файл"]}\n')
print(f"Адреса: \n{programing_terms['Адреса']}\n")
print(f"Біт: \n {programing_terms['Біт']}\n")
print(f"Блок-схема: \n {programing_terms['Блок-схема']}\n")
