# Голосарій 2.0

programing_terms = {
    "Абстракція": "− в об’єктно-орієнтованому програмуванні це надання об'єкту характеристик, які відрізняють його від всіх інших об'єктів, чітко визначаючи його концептуальні границі.",
    "Активний файл": "− те саме, що відкритий файл.",
    "Адреса": "– номер байта в оперативній або іншій пам'яті комп'ютера.",
    "Біт": '− найменша одиниця інформації в комп\'ютері, що приймає значення "0" або "1".',
    "Блок-схема": "– форма вираження алгоритмів. Послідовність дій задається стрілками.",
    "Границя індексу": "(subscrіpt boundary) − ціле число, що вказує найменше (нижня границя) або найбільше (верхня границя) можливе значення індексу.",
    "Деструктор": "− містить набір операторів, які виконуються перед знищенням об'єкта. ",
    "Дефрагментація": "− це оптимізація дискового простору, упорядкування кластерів, які належать одному файлу.",
    "Динамічна пам’ять": "− спосіб розподілу ОЗП між завданнями.",
    "Задача": "– питання чи вимога щось зробити (обчислити, намалювати).",
}


for key, value in programing_terms.items():
    print(f"{key}\n {value}\n")
